import { IContent } from './types'

export const HopeIgnited: IContent[] = [
  {
    type: 'text',
    data: {
      quote: 'Hope ignited',
    },
  },
  {
    type: 'multipleChoice',
    data:{
      choiceList:[
        'มีความหวัง',
        'สิ้นหวัง',
      ]
    }
  },
  {
    type: 'paragraph',
    data: {
      title:'Hope Ignited',
      quote:'If justice takes place, there shall be hope.',
      quoteOwner:'ALBERTO MAGUEL',
      content:[
        '“กฎหมาย” คืออะไร ?',
        'กฎหมาย คือ กฎเกณฑ์ คำสั่ง หรือข้อบังคับของสังคม ซึ่งเป็นกติกาของรัฐหรือประเทศ กฎหมายเป็นสิ่งที่ถูกนำมาใช้ควบคุมความประพฤติในชีวิตประจำวันของผู้คนเพื่อสร้างความสงบสุขและความเท่าเทียมในสังคม หรือเรียกได้ว่า การมีกฎหมายถือเป็นการจัดระเบียบสังคมอย่างหนึ่ง เนื่องจากกฎหมายเป็นสิ่งที่ผู้คนต้องปฏิบัติตาม หากฝ่าฝืนจะมีบทลงโทษ',
        'กฎหมายเชื่อมโยงและนำไปสู่ความหวังได้อย่างไร?',
        'เมื่อกฎหมายเกิดขึ้นเพื่อบังคับใช้ในสังคม กฎหมายจึงมีวิวัฒนาการควบคู่ไปกับมนุษย์ รวมถึงสะท้อนภาพอารยธรรมและสภาพสังคมในช่วงเวลานั้น ยิ่งไปกว่านั้น กฎหมายยังช่วยคุ้มครองกลุ่มเปราะบาง และประกันสิทธิเสรีภาพให้แก่ทุกคน กฎหมายจึงเปรียบเสมือนเครื่องมือที่ถูกออกแบบมาเพื่อสร้างทางออกจากสถานการณ์เลวร้ายต่าง ๆ ที่เกิดขึ้น และเป็นช่องทางที่ทำให้คนมีความหวังและมองเห็นโอกาสที่จะเกิดการเปลี่ยนแปลง',
        'กฎหมายที่ใช้บังคับในปัจจุบันเกิดจากการร่างพระราชบัญญัติขึ้นมาแล้วเสนอเข้าพิจารณาเป็นกฎหมาย ดังนั้น ในทุก ๆ การร่างกฎหมายใหม่จึงเป็นสิ่งสำคัญที่จะนำพาประเทศไปสู่ความหวังใหม่ เช่น พระราชบัญญัติการศึกษาแห่งชาติ พ.ศ. 2542 ที่เปิดโอกาสให้ประชาชนไทยทุกคนมีสิทธิเสมอกันในการรับการศึกษาจนจบการศึกษาขั้นพื้นฐานโดยไม่เสียค่าใช้จ่าย แต่ในทางกลับกัน กฎหมายบางฉบับก็สามารถบั่นทอนความหวังของคนในสังคมได้เช่นกัน ดังเช่น ร่างพระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. 2564 ที่ทำให้ประชาชนเข้าถึงข้อมูลข่าวสารของราชการได้ยากยิ่งขึ้น',
      ],
      contentRef:[
        {
          text:'www.ilaw.or.th',
          url:'https://www.ilaw.or.th/node/1008',
        },
        {
          text:'www.ilaw.or.th',
          url:'https://www.ilaw.or.th/node/5711',
        },
      ]
    },
  },
  {
    type: 'paragraph',
    data: {
      title:'Hope Ignited',
      quote:'If justice takes place, there shall be hope.',
      quoteOwner:'ALBERTO MAGUEL',
      content:[
        'กฎหมายส่งเสริมความหวัง',
        '1. รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540', 
        '1.1 เราสามารถพูดได้หรือไม่ว่า รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540 เป็นรัฐธรรมนูญที่ดีที่สุดเท่าที่เคยมีมา แล้วรัฐธรรมนูญส่งเสริมความหวังอย่างไร ?',
	      'รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540 มีความโดดเด่น เนื่องจากการมีส่วนร่วมของภาคประชาชนหลายฝ่าย และข้อกฎหมายที่แสดงถึงการรับรองสิทธิ รัฐธรรมนูญฉบับนี้จึงเปรียบเสมือนรากฐานในการช่วยขับเคลื่อนประเทศผ่านการใช้นิตินโยบาย ซึ่งคำนึงถึงสิทธิเสรีภาพของประชาชนเป็นหลัก',
        '1.2 ที่มาของรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540',
        'จุดเริ่มต้นเกิดจากเหตุการณ์พฤษภาทมิฬในปี พ.ศ. 2535 ซึ่งนำไปสู่การแก้ไขรัฐธรรมนูญหลายมาตราในช่วงรัฐประหาร และในปี พ.ศ. 2534 ได้มีการเรียกร้องให้แก้ไขรัฐธรรมนูญอีกครั้งในเรื่องคุณสมบัติของนายกที่ต้องมาจากสมาชิกสภาผู้แทนราษฎร จนเป็นรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540 ของประเทศไทย', 
        '1.3 ความสำคัญของรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540',
        'รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540 มีความสำคัญหลายประการ ทั้งการตื่นตัวของประชาชนทั่วประเทศ การรณรงค์ให้รัฐสภารับร่างรัฐธรรมนูญ การที่นักวิชาการมีส่วนร่วมในการร่างรัฐธรรมนูญ การรับรองสิทธิตามรัฐธรรมนูญอย่างที่ไม่เคยมีในอดีต รวมทั้งการตั้งองค์กรอิสระ และการออกข้อกำหนดซึ่งเพิ่มความชอบธรรมให้รัฐธรรมนูญ',

      ]
    },
  },
  {
    type: 'paragraph',
    data: {
      title:'Hope Ignited',
      quote:'If justice takes place, there shall be hope.',
      quoteOwner:'ALBERTO MAGUEL',
      content:[
        '2. กฎหมายอื่น ๆ',
        'ข้อกฎหมายที่น่าสนใจต่อไปนี้มีความเกี่ยวข้องกับวัยเรียนและวัยทำงาน ถือเป็นเรื่องใกล้ตัวทุกคน และเป็นตัวอย่างที่ดีในการแสดงให้เห็นถึงผลของการเรียกร้อง อันนำมาซึ่งกฎหมายที่ช่วยสร้างความหวังให้แก่ประชาชน',
        '2.1 เรียนฟรี 12 ปี สร้างอนาคตของชาติ ตามพระราชบัญญัติการศึกษาแห่งชาติ พ.ศ. 2542',
        '- เราได้รับประโยชน์อะไรจากพระราชบัญญัติการศึกษาแห่งชาติ พ.ศ. 2542 ?',
        'รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2540 และรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2560 บัญญัติไว้ว่า “บุคคลมีสิทธิเสมอกันในการรับ ‘การศึกษาขั้นพื้นฐานไม่น้อยกว่าสิบสองปี’ ที่รัฐจะต้องจัดให้โดยไม่เก็บค่าใช้จ่าย”', 
        '- คุณคิดอย่างไร หากมีการเรียกร้องขยายระยะเวลาเรียนฟรี ?',
        'ด้วยเหตุที่การศึกษาเป็นพื้นฐานสำคัญในการพัฒนาสังคม แต่ความเหลื่อมล้ำกลับทำให้เด็กหลายคนไม่สามารถเข้าถึงการศึกษาได้ ปัจจุบันจึงมีการเรียกร้องให้ขยายระยะเวลาเรียนฟรี จาก 12 ปี เป็น 15 ปี',
      ]
    },
  },
  {
    type:'carousel',
    data:{
      title:'Hope Ignited',
      quote:'2.2 กฎหมายลาคลอด 90 วันที่แลกมาด้วยหยาดเหงื่อและแรงกาย',
      contents:[
        {
          text:'อย่างไรก็ตาม คนบางกลุ่มมีความเห็นว่าควรเพิ่มวันลาคลอดเป็น 180 วันตามบริบทในปัจจุบัน เนื่องจากองค์การอนามัยโลกและกระทรวงสาธารณสุขได้ให้ข้อสรุปว่าเป็นจำนวนวันที่เหมาะสม เพราะแม่ควรให้นมลูกเป็นเวลา 6 เดือน แต่สิ่งนี้ก็ยังคงเป็นเพียงข้อเรียกร้องอยู่\nสิทธิการลาคลอดเป็นมิติหนึ่งที่กดทับแรงงานหญิง เดิมพระราชบัญญัติประกันสังคม พ.ศ. 2533 ให้สิทธิลาคลอดได้ 60 วัน โดยได้รับค่าจ้าง 30 วัน แต่จากการรณรงค์เปลี่ยนแปลงสิทธิลาคลอดในปี พ.ศ. 2536 ทำให้เกิดการแก้ไขกฎหมาย ซึ่งส่งผลให้หญิงสามารถใช้สิทธิลาคลอดได้ 90 วัน และในปัจจุบันได้มีการแก้ไขเพิ่มเติมให้หญิงสามารถลาคลอดได้ไม่เกิน 98 วัน โดยได้รับค่าจ้าง 45 วัน ตามพระราชบัญญัติคุ้มครองแรงงาน ฉบับที่ 7 พ.ศ. 2562',
          imageUrl:'2-1.png',
          imagePosition: 'top',
          imageRefs:[
            {
              text:'prachatai.com',
              url:'https://prachatai.com/journal/2021/03/92015',
            }
          ],
          contentRefs:[
            {
              text:'ilaw.or.th',
              url:'https://ilaw.or.th/node/5426',
            },
            {
              text:'the101.world',
              url:'https://www.the101.world/parental-leave/'
            },
            {
              text:'prachatai.com',
              url:'https://prachatai.com/journal/2021/03/92015',
            },
            {
              text:'ilaw.or.th',
              url:'https://ilaw.or.th/node/4209',
            }
          ]
        },
      ],
    }
  },
  {
    type:'carousel',
    data:{
      title:'Hope Ignited',
      quote:'กฎหมายทำลายความหวัง',
      contents:[
        {
          text:'1. รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2560\nแม้ว่ารัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2560 ได้ผ่านเสียงประชามติของประชาชนถึง 16 ล้านเสียง อย่างไรก็ตาม รัฐธรรมนูญฉบับนี้กลับไม่ได้ยึดโยงกับความต้องการของคนในประเทศ และแฝงไปด้วยกฎเกณฑ์ต่าง ๆ ที่เอื้อประโยชน์ต่อกลุ่มบุคคลบางกลุ่ม ดังจะได้อธิบายดังต่อไปนี้\nการเลือกนายกรัฐมนตรีในบทเฉพาะกาลต้องอาศัยเสียงมากกว่า 375 เสียงจากสมาชิกสภาผู้แทนราษฎร จำนวน 500 คน และสมาชิกวุฒิสภา จำนวน 250 คน รวมกัน แต่ทว่า สมาชิกวุฒิสภาไม่ได้มีจุดยึดโยงกับประชาชน ด้วยเหตุนี้จึงส่งผลต่อผลการเลือกนายกรัฐมนตรีที่ไม่อาจกล่าวได้ว่าเป็นผลที่มาจากประชาชนอย่างแท้จริง\n1.2 ขั้นตอนการแก้ไขเพิ่มเติมรัฐธรรมนูญ\nในวันที่ 17 มีนาคม 2564 ร่างแก้ไขรัฐธรรมนูญวาระสามล่ม เนื่องจากได้รับเสียงเห็นชอบจากสมาชิกรัฐสภาไม่ถึงครึ่ง และได้รับเสียงเห็นชอบจากสมาชิกวุฒิสภาน้อยกว่าหนึ่งในสาม ดังนั้น จึงจำเป็นต้องพิจารณาถึงขั้นตอนการแก้ไขรัฐธรรมนูญฉบับปี พ.ศ. 2560 ว่ามีปัญหาอย่างไร\nการแก้ไขรัฐธรรมนูญต้องผ่านขั้นตอนสามวาระ โดยในแต่ละวาระต้องอาศัยเสียงของสมาชิกรัฐสภาส่วนใหญ่ และต้องอาศัยเสียงของสมาชิกวุฒิสภาที่ไม่ได้มีที่มาจากประชาชนรวมอยู่ด้วย\nและด้วยเหตุนี้เองจึงทำให้การแก้ไขรัฐธรรมนูญเป็นไปได้ยาก และจะแก้ไขไม่ได้เลย หากการแก้ไขนั้นไม่สอดคล้องกับความต้องการของสมาชิกวุฒิสภา ส่งผลให้รัฐธรรมนูญฉบับนี้มีส่วนในการทำลายความหวังในการพัฒนาประเทศของคนในสังคม',
          imageUrl:'2-1.png',
          imagePosition: 'top',
          imageRefs:[
            {
              text:'voicetv',
              url:' https://voicetv.co.th/read/boRtPSbOX',
            }
          ]
        },
      ]
    }
  },
  {
    type: 'paragraph',
    data: {
      title:'Hope Ignited',
      quote:'If justice takes place, there shall be hope.',
      quoteOwner:'ALBERTO MAGUEL',
      content:[
        '1.2 ขั้นตอนการแก้ไขเพิ่มเติมรัฐธรรมนูญ',
        'ในวันที่ 17 มีนาคม 2564 ร่างแก้ไขรัฐธรรมนูญวาระสามล่ม เนื่องจากได้รับเสียงเห็นชอบจากสมาชิกรัฐสภาไม่ถึงครึ่ง และได้รับเสียงเห็นชอบจากสมาชิกวุฒิสภาน้อยกว่าหนึ่งในสาม ดังนั้น จึงจำเป็นต้องพิจารณาถึงขั้นตอนการแก้ไขรัฐธรรมนูญฉบับปี พ.ศ. 2560 ว่ามีปัญหาอย่างไร',
        'การแก้ไขรัฐธรรมนูญต้องผ่านขั้นตอนสามวาระ โดยในแต่ละวาระต้องอาศัยเสียงของสมาชิกรัฐสภาส่วนใหญ่ และต้องอาศัยเสียงของสมาชิกวุฒิสภาที่ไม่ได้มีที่มาจากประชาชนรวมอยู่ด้วย',
        'และด้วยเหตุนี้เองจึงทำให้การแก้ไขรัฐธรรมนูญเป็นไปได้ยาก และจะแก้ไขไม่ได้เลย หากการแก้ไขนั้นไม่สอดคล้องกับความต้องการของสมาชิกวุฒิสภา ส่งผลให้รัฐธรรมนูญฉบับนี้มีส่วนในการทำลายความหวังในการพัฒนาประเทศของคนในสังคม',
      ],
      contentRef:[

        {
          text:'ilaw.or.th',
          url:'https://ilaw.or.th/node/5839',
        },
        {
          text:'ilaw.or.th',
          url:'https://ilaw.or.th/node/5507',
        },
      ],
    },
  },
  {
    type: 'paragraph',
    data: {
      title:'Hope Ignited',
      quote:'If justice takes place, there shall be hope.',
      quoteOwner:'ALBERTO MAGUEL',
      content:[
        '2. ร่างพระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. 2564',
        'พระราชบัญญัติข้อมูลข่าวสารของราชการ พ.ศ. 2540 ที่ใช้อยู่ในปัจจุบันถูกจัดทำขึ้นเพื่อให้ประชาชนสามารถเข้าถึงข้อมูลของราชการได้มากขึ้น แต่แล้วร่างพระราชบัญญัติข้อมูลข่าวสารของราชการฉบับใหม่ที่คณะรัฐมนตรีมีมติเห็นชอบในช่วงต้นปี พ.ศ. 2564 กลับมีเนื้อหามุ่งที่จะ “ปกปิด” มากกว่า “เปิดเผย” ข้อมูล',
        '3. ประมวลกฎหมายอาญา มาตรา 112',
        'มาตรา 112 แห่งประมวลกฎหมายอาญา เป็นกฎหมายเกี่ยวข้องกับการหมิ่นประมาทองค์พระมหากษัตริย์ พระราชินี รัชทายาท และผู้สำเร็จราชการแทนพระองค์ ซึ่งมีความเชื่อมโยงกับระบอบการปกครองของประเทศไทยที่มีมาอย่างช้านาน มาตรานี้เป็นมาตราสำคัญที่ถูกพูดถึงอย่างแพร่หลายในสถานการณ์ปัจจุบัน อย่างไรก็ดี มาตรานี้ยังมีขอบเขตและมาตรฐานในการบังคับใช้ที่ไม่แน่ชัด จึงอาจกลายเป็นบทบัญญัติที่ถูกใช้เป็นเครื่องมือในการละเมิดสิทธิเสรีภาพของประชาชนตามระบอบการปกครองแบบประชาธิปไตยได้',
      ],
      contentRef:[
        {
          text:'www.thairath.co.th',
          url:'https://www.thairath.co.th/news/2063983',
        },
        {
          text:'ilaw.or.th',
          url:'https://ilaw.or.th/node/5874',
        },
        {
          text:'youtube.com',
          url:'https://www.youtube.com/watch?v=5SARICaE1Rg',
        },
        {
          text:'112story.com',
          url:'https://112story.com/112',
        }

      ]
    },
  }

]