import { IContent } from './types'

export const WhatIsHope: IContent[] = [
  {
    type: 'text',
    data: {
      quote: 'What is Hope?',
    },
  },
  {
    type: 'text',
    data: {
      quote: 'Faith is the bird that feels the light when the dawn is still dark',
      quoteOwner: 'Rabindranath Tagore (Indian poet)',
      translation: 'ศรัทธา คือ วิหกเหินเวหา เพื่อรับแสงแห่งทิวาก่อนรุ่งอรุณ',
    },
  },
  {
    type:'paragraph',
    data: {
      content: [
        '“ความหวังคืออะไร” เชื่อได้เลยว่า ทุกคนหรือแทบจะทุกคนในสังคมคงรู้จักคำ ๆ นี้เป็นอย่างดี แต่หากจะให้อธิบายความหมายของมัน หลายคนคงไม่สามารถบรรยายออกมาเป็นคำพูดได้ เพราะในแต่ละยุคสมัย ความเชื่อหรือแนวคิดก็ได้นิยามความหมายของ “ความหวัง” แตกต่างกันออกไปมากมาย เนื่องจากเป็นการยากที่จะสื่อความออกมาให้ครอบคลุมได้ทั้งหมด อย่างไรก็ดี เราสามารถสรุปนิยามของความหวังได้คร่าว ๆ ดังนี้ ',
        'ความหวัง คือ ความสามารถที่จะเชื่อ จินตนาการ หรืออยากให้สิ่ง ๆ ใดเกิดขึ้น ซึ่งมาจากการมองเห็นช่องที่จะเกิดขึ้นในอนาคต แต่จะเป็นจริงหรือไม่ย่อมขึ้นอยู่กับปัจจัยต่าง ๆ ด้วย ความหวังจึงเป็นพลังของชีวิต ดังคำกล่าวที่ว่า “ชีวิตที่อยู่อย่างไม่มีความหวังคือการสิ้นชีวิต”',
        'แท้จริงแล้ว มนุษย์ทุกคนย่อมมีความหวัง เพราะการมีความหวังเป็นหนึ่งในกระบวนการที่จะทำให้บุคคลเดินหน้าต่อไปได้จากสิ่งต่าง ๆ แม้สิ่งเหล่านั้นอาจทำให้บุคคลหนึ่งเกิดความ “สิ้นหวัง” ได้ก็ตาม',
      ]
    },
  },
  {
    type:'paragraph',
    data: {
      content: [
        '“ความหวัง” ส่งผลให้เกิดการเปลี่ยนแปลงในด้านต่าง ๆ ดังนี้',
        '1. ด้านการเมือง',
        'ประเทศไทยมีปัญหาต่าง ๆ เกิดขึ้นมากมาย เช่น ปัญหาการจัดตั้งรัฐบาล การทุจริตคอร์รัปชัน ความสงสัยในการบริหารประเทศของรัฐบาล การบังคับใช้กฎหมายที่ไม่เป็นไปตามหลักประชาธิปไตย รวมถึงการห้ามเห็นต่างในเรื่องต่าง ๆ เป็นต้น',
        'อย่างไรก็ดี แม้ว่าประเทศไทยจะปกครองในระบอบประชาธิปไตย ซึ่งมุ่งเน้นการมีส่วนร่วมของประชาชน โดยใช้หลักการถือเสียงข้างมากเป็นเกณฑ์ควบคู่ไปกับการเคารพสิทธิของเสียงข้างน้อย แต่เสียงข้างน้อยที่มีความเห็นต่างก็อาจเป็นความหวังที่สามารถเปลี่ยนแปลงสังคมได้ โดยจะเห็นได้จากรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2560 มาตรา 133 ที่ให้ประชาชนซึ่งมีสิทธิเลือกตั้งจำนวนไม่น้อยกว่า 10,000 คนรวบรวมรายชื่อเพื่อเสนอร่างกฎหมายได้',
      ]
    },
  },
  {
    type:'paragraph',
    data: {
      content: [
        '2. ด้านเศรษฐทรัพย์ (กรณีวัคซีนโควิด-19)', 
        'จากข้อมูล ณ วันที่ 15 ตุลาคม 2564 ประเทศไทยมีผู้ที่ยังไม่ได้รับการฉีดวัคซีนโควิด-19 ถึง 64.2% เนื่องจากการลงทะเบียนเพื่อฉีดวัคซีนทำได้ยาก ประชาชนต้องเสียค่าใช้จ่ายในวัคซีนบางประเภทเองทั้ง ๆ ที่เป็นสิทธิพื้นฐาน และประเทศไทยไม่เข้าร่วมโครงการโคแวกซ์ (COVAX) ที่มีจุดมุ่งหมายเพื่อสั่งซื้อและส่งวัคซีนให้ประเทศต่าง ๆ อีกทั้งมีการฉีดวัคซีนไขว้สูตรที่ยังไม่ได้รับการรับรองจากองค์การอนามัยโลก (World Health Organization)',
        'แม้ปัญหาการจัดการวัคซีนดังกล่าวนี้จะทำให้รู้สึกสิ้นหวัง แต่ภาคประชาสังคมก็มีบทบาทสำคัญในการเป็นตัวกลางและให้ความช่วยเหลือหลากหลายด้าน ทั้งในเชิงเทคนิค การบริจาคอุปกรณ์ป้องกันโรค ยาและเวชภัณฑ์ที่จำเป็น รวมทั้งเงินช่วยเหลือ ตลอดจนจัดทำและเผยแพร่คู่มือหรือชุดความรู้ในภาษาท้องถิ่นแก่กลุ่มชาติพันธุ์',
      ],
      contentRef:[
        {
          text:'ourworldindata.org',
          url:'https://ourworldindata.org/covid-vaccinations?country=TH',
        }
      ]
    },
  },
  {
    type:'paragraph',
    data: {
      content: [
        'รัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2560 มีบทบัญญัติที่รับรองสิทธิต่าง ๆ ของประชาชน เช่น มาตรา 27 ที่มีสาระสำคัญว่า บุคคลมีสิทธิและเสรีภาพและได้รับการคุ้มครองทางกฎหมายเท่าเทียมกัน ซึ่งเป็นหลักประกันในการคุ้มครองสิทธิและเสรีภาพของปวงชนชาวไทย และมาตรา 47 ที่มีสาระสำคัญว่า บุคคลมีสิทธิได้รับบริการสาธารณสุขของรัฐ ในสถานการณ์การระบาดของโรคโควิด-19เช่นนี้ วัคซีนก็ถือเป็นสิทธิขั้นพื้นฐานที่ประชาชนควรได้รับเช่นกัน',
        'นอกจากนี้ยังมีกฎหมายเฉพาะที่เกี่ยวกับเรื่องวัคซีน คือ พระราชบัญญัติความมั่นคงด้านวัคซีนแห่งชาติ พ.ศ.2561 ซึ่งมีสาระสำคัญเกี่ยวกับการส่งเสริมและสนับสนุนเพื่อให้มีการวิจัย การพัฒนา การผลิต การประกัน การควบคุมคุณภาพ การจัดหา และการกระจายวัคซีนที่เหมาะสมและเพียงพอ โดยมีคณะกรรมการที่กำหนดนโยบายและแผนยุทธศาสตร์ความมั่นคงด้านวัคซีนแห่งชาติ มีองค์กรและคณะกรรมการบริหารซึ่งทำหน้าที่ขับเคลื่อนนโยบายและแผนยุทธศาสตร์',
      ]
    },
  },
  {
    type:'paragraph',
    data: {
      content: [
        '3. ด้านการศึกษา',
        'แม้ว่าประเทศไทยจะมีการออกกฎหมายพระราชบัญญัติการศึกษาแห่งชาติ พ.ศ. 2542 ซึ่งเป็นกฎหมายที่สอดคล้องกับบทบัญญัติของรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ. 2560 มาตรา 54 ที่กำหนดให้รัฐต้องดำเนินการให้เด็กต้องสามารถเข้าถึงการศึกษาที่มีคุณภาพ อีกทั้งปรับปรุงการศึกษาให้สอดคล้องกับความเปลี่ยนแปลงทางเศรษฐกิจและสังคม',
        'อย่างไรก็ดี จากสถิติของกองทุนเพื่อความเสมอภาคทางการศึกษาพบว่ามีนักเรียนด้อยโอกาสมากกว่า 3,625,048 คน โดยส่วนใหญ่เป็นเด็กยากจน และมีเด็กที่หลุดจากระบบการศึกษาแล้วกว่า 43,060 คน อันมีสาเหตุหลัก ๆ มาจากความเหลื่อมล้ำทางการศึกษา งบประมาณด้านการศึกษาที่ลดลง การเรียนออนไลน์ที่ไม่ได้ประสิทธิภาพซึ่งส่งผลให้นักเรียนเกิดความเครียด และค่าสมัครสอบเข้าศึกษาต่อในระบบอุดมศึกษาที่ไม่สอดคล้องกับสภาพเศรษฐกิจ ปัญหาเหล่านี้ต่างเป็นปัญหาที่สำคัญและควรได้รับการแก้ไข', 
        'เยาวชนคืออนาคตของชาติ การกำหนดนโยบายเกี่ยวกับการศึกษาหรือการบัญญัติกฎหมายเพิ่มเติมให้สอดรับกับสิทธิตามที่กฎหมายข้างต้นรับรองจึงเป็นสิ่งที่ควรให้ความสำคัญ เพื่อแก้ไขปัญหาการด้อยโอกาสทางการศึกษาของเยาวชนไทย',
      ],
      contentRef:[
        {
          text:'isee.eef.or.th',
          url:'https://isee.eef.or.th/screen/disabled/disabled.html',
        },
        {
          text:'thematter.co',
          url:'https://thematter.co/social/education/dek65-and-uni-entrance-fee/153268',
        },
        {
          text:'workpointtoday.com',
          url:'https://workpointtoday.com/education-38/',
        }
      ]
    },
  },
  {
    type:'paragraph',
    data: {
      content: [
        'จากการเปลี่ยนแปลงในด้านการเมือง ด้านเศรษฐทรัพย์ และด้านการศึกษาดังที่ได้กล่าวมานั้น จะเห็นได้ว่า ทุกปัญหาล้วนแต่ก่อให้เกิดความสิ้นหวัง แต่กระนั้น ทุกปัญหาย่อมมีทางแก้ไข ความเปลี่ยนแปลงทั้งหลายย่อมเกิดขึ้นจากจุดเริ่มต้นเล็ก ๆ ซึ่งก็คือการมีความหวังว่าจะได้รับสิ่งที่ดีกว่า และในทุกความสิ้นหวังยังคงมีแสงแห่งความหวังที่พร้อมจะก่อตัวขึ้นเสมอ',
      ]
    },
  },
]
