import { IContent } from './types'

export const WhatIsHope: IContent[] = [
  {
    type: 'text',
    data: {
      quote: 'What is Hope?',
    },
  },
  {
    type: 'text',
    data: {
      quote: 'Where there is hope, there is life',
      quoteOwner: 'Anne Frank',
      quoteOwnerRef: 'JEWISH’S DIARIST DURING WW2',
    },
  },
  {
    type:'paragraph',
    data: { 
      content: [
        '“ความหวังคืออะไร” เชื่อได้เลยว่า ทุกคนหรือแทบจะทุกคนในสังคมคงรู้จักคำ ๆ นี้เป็นอย่างดี แต่หากจะให้อธิบายความหมายของมัน หลายคนคงไม่สามารถบรรยายออกมาเป็นคำพูดได้ เพราะในแต่ละยุคสมัย ความเชื่อหรือแนวคิดก็ได้นิยามความหมายของ “ความหวัง” แตกต่างกันออกไปมากมาย เนื่องจากเป็นการยากที่จะสื่อความออกมาให้ครอบคลุมได้ทั้งหมด อย่างไรก็ดี เราสามารถสรุปนิยามของความหวังได้คร่าว ๆ ดังนี้ ',
        'ความหวัง คือ ความสามารถที่จะเชื่อ จินตนาการ หรืออยากให้สิ่ง ๆ ใดเกิดขึ้น ซึ่งมาจากการมองเห็นช่องที่จะเกิดขึ้นในอนาคต แต่จะเป็นจริงหรือไม่ย่อมขึ้นอยู่กับปัจจัยต่าง ๆ ด้วย ความหวังจึงเป็นพลังของชีวิต ดังคำกล่าวที่ว่า “ชีวิตที่อยู่อย่างไม่มีความหวังคือการสิ้นชีวิต”',
        'แท้จริงแล้ว มนุษย์ทุกคนย่อมมีความหวัง เพราะการมีความหวังเป็นหนึ่งในกระบวนการที่จะทำให้บุคคลเดินหน้าต่อไปได้จากสิ่งต่าง ๆ แม้สิ่งเหล่านั้นอาจทำให้บุคคลหนึ่งเกิดความ “สิ้นหวัง” ได้ก็ตาม',
      ]
    },
  },
  {
    type: 'multipleChoice',
    data: { choiceList: ['ตัวเอง', 'เพื่อน', 'จะ F ได้ไง ก็ถอนกันหมด'] },
  },
  {
    type: 'carousel',
    data: {
      quote: 'Where there is hope, there is life',
      quoteOwner: 'ANNE FRANK',
      contents: [
        {
          text: 'ก็แหม...เล่นไปลงวิชายากๆ เรียนไปได้ 2 วัน จาก Online กายก็ไป On-bed เฉยเลย จะไม่ F ได้อย่างไร แต่อย่าได้กังวลไป ถ้าถอนทันก็สิ้นเรื่อง\nก็แหม...เล่นไปลงวิชายากๆ เรียนไปได้ 2 วัน จาก Online กายก็ไป On-bed เฉยเลย จะไม่ F ได้อย่างไร แต่อย่าได้กังวลไป ถ้าถอนทันก็สิ้นเรื่อง',
          contentRefs: [
            {
              text: 'Wikipedia',
              url: 'https://en.wikipedia.org/wiki/Wikipedia',
            },
          ],
          imageRefs: [
            {
              text: 'Wikipedia2',
              url: 'https://en.wikipedia.org/wiki/Wikipedia',
            },
            {
              text: 'Wikipedia2',
              url: 'https://en.wikipedia.org/wiki/Wikipedia',
            },
          ],
        },
        {
          text: 'ก็แหม...เล่นไปลงวิชายากๆ เรียนไปได้ 2 วัน จาก Online กายก็ไป On-bed เฉยเลย จะไม่ F ได้อย่างไร แต่อย่าได้กังวลไป ถ้าถอนทันก็สิ้นเรื่อง',
          imageUrl: '02.png',
          imagePosition: 'top',
        },
        {
          text: 'ก็แหม...เล่นไปลงวิชายากๆ เรียนไปได้ 2 วัน จาก Online กายก็ไป On-bed เฉยเลย จะไม่ F ได้อย่างไร แต่อย่าได้กังวลไป ถ้าถอนทันก็สิ้นเรื่อง',
          imageUrl: '01.png',
          imagePosition: 'left',
        },
      ],
    },
  },
]
